{"intents":[{"patterns":["Hi"],"link":"","responses":["Hello!"],"tag":"greeting"},{"patterns":["See you later"],"link":" ","responses":["Talk to you later"],"tag":"goodbye"},{"patterns":["Goodbye"],"link":" ","responses":["Goodbye!"],"tag":"goodbye"},{"patterns":["what is your name"],"link":" ","responses":["You can call me Tommy"],"tag":"name"},{"patterns":["who are you"],"link":" ","responses":["I'm a robot"],"tag":"question"},{"patterns":["who invented you"],"link":" ","responses":["I'm invented by a computer enginneer."],"tag":"question2"},{"patterns":["what did you do last weekend"],"link":" ","responses":["It was so bored, I was at home."],"tag":"lastweek"},{"patterns":["when can i talk to you"],"link":" ","responses":["I'm working 7\/24"],"tag":"time"},{"patterns":["how are you"],"link":" ","responses":["Fine, you?"],"tag":"status"},{"patterns":["fine, thanks"],"link":" ","responses":["Good to hear that"],"tag":"status2"},{"patterns":["sad"],"link":" ","responses":["Why you are sad?"],"tag":"status3"},{"patterns":["what are you doing"],"link":" ","responses":["I am always chatting with people."],"tag":"doing"},{"patterns":["nice to meet you"],"link":" ","responses":["Nice to meet you too"],"tag":"meet"},{"patterns":["where are you from"],"link":" ","responses":["I'm from Turkey"],"tag":"from"},{"patterns":["Say something"],"link":" ","responses":["What do you want me to tell you?"],"tag":"saysomething"},{"patterns":["are you happy"],"link":" ","responses":["Yes,I am happy"],"tag":"happy"},{"patterns":["are you sad"],"link":" ","responses":["No, I am not sad. I'm happy."],"tag":"sad"},{"patterns":["can you say something about you"],"link":" ","responses":["I'm a man and I'm a clever person,I think thats enough"],"tag":"me"},{"patterns":["who is the einstein"],"link":" ","responses":["Einstein was the most clever person in the world. He discover a lots of things."],"tag":"einstein"},{"patterns":["what can I do to prevent dog dehydration"],"link":" ","responses":["Exercise your dog early in the morning or evening hours to avoid the most intense heat of the day. Be sure to take along water and a water wherever you go. Don't rely on natural water sources being available. Allow for plenty of rest and water breaks during play activity and exercise. Your dog may not know his limits and will continue to enthusiastically chase the Frisbee long after it's time to slow down. Provide water access frequently. When out in the heat, be sure to provide a water stop at least once every 15 to 20 minutes. If your dog is preoccupied with something else (other dogs, a tennis ball, etc) or too excited to drink, best to cut your outing short for the sake of preventing dehydration. As much as we love to bring our dogs with us everywhere, be reminded that, when temperatures are soaring, your dog well being may be best served by being left at home. If you have any questions or concerns, you should always visit or call your veterinarian they are your best resource to ensure the health and well-being of your pets."],"tag":"dog"},{"patterns":["my hamster has a round piece of meat in her ear what can it be"],"link":" ","responses":["It is difficult to comment because we did not see what you mentioned. The hematoma, which is a small collection of blood, can be an inflammatory swelling or a cystic part. The best thing to do is to get your idea by showing your hamster to a veterinarian. If it can be intervened, perhaps a small surgical intervention may be required. Get well soon."],"tag":"hamster"},{"patterns":["how do i know if my cat is in pain?"],"link":"   ","responses":["studies were recently conducted in order to reach a consensus about criteria when evaluating pain in cats. A total of 91 signs, chosen from the existing literature, were assessed during four rounds of evaluation, by 19 feline medicine experts. Some worked in private practice, others in veterinary schools Ultimately, 25 signs were considered to be reliable and sensitive for indicating pain in cats, across a range of different clinical conditions1: Top 5 signs Appetite decrease, avoiding bright areas, growling, groaning, eyes closed. Remember, the presence of any single one of these 25 signs means pain. If you see any of these signs in your cat, see your veterinarian right away. Also remember that the absence of a sign does not mean your cat is no pain. These signs may help both vets and cat guardians better assess the pain status of cats in their care."],"tag":"cat"},{"patterns":["my cat has constant diarrhea. what should i do?"],"link":"  ","responses":["If your cat has diarrhea, give it plenty of fresh, clean water to prevent dehydration. Then remove cat's food for no more than 12 to 24 hours. Take your cat to the vet if he or she still has diarrhea. if you notice vomiting, fever, lethargy, or loss of appetite or if your cat is straining to defecate."],"tag":"cat2"},{"patterns":["my dog is constantly scratching her ear and shaking her head, I wonder what trouble."],"link":"   ","responses":["If your dog is constantly trying to scratch her ears and shakes her head constantly, or if you spot a yellowish liquid in your ears that smells bad when your pet is approaching you, there is probably inflammation in your dog's ears."],"tag":"dog2"},{"patterns":["I have vomiting and swelling in my dog, what trouble my dog may have"],"link":"  ","responses":["The main symptoms of stomach inflammation in dogs are vomiting and abdominal swelling, but can also cause loss of appetite, weight loss, lack of energy, and excessive production of saliva."],"tag":"dog3"},{"patterns":["my turtle floats curved, there is pinking in the bottom shell, it collapses to the bottom when put in water"],"link":" ","responses":["You may have a cold or lung infection in your turtle. By increasing the temperature of the water by 2-3 degrees, you should make the environment of the turtle slightly warmer. You can also add vitamins to the water. If your turtle's disease does not go away, consult a veterinarian."],"tag":"turtle"},{"patterns":["my turtle has a deformation in its shell, what kind of problem can it have"],"link":"  ","responses":["Contrary to what it is supposed to be, it takes different forms, there are pits or elevations, and it takes the most common form of hump. The main reason for this can be shown as deficiencies in the intake of vitamins and calcium. When you notice the state of the crust deformation, you need to change your menu prepared for your turtle. Do not try to correct deformations with your hands, this can damage internal organs. After that, it will be the only treatment to stay in this way and to regulate the feed."],"tag":"turtle2"},{"patterns":["my turtle has eye irritation what can i do"],"link":"  ","responses":["It is caused by the turtle remaining in the air flow or in terms of very cold environment. It is also possible that this condition may arise from Vitamin A deficiency in non-adult turtles. You should apply an antibiotic-effective eye cream to the eye contour on the eyelid. Do not put it into the water immediately after doing this operation, it should be on land for 5 minutes and the medicine should show its effect and then it should be left in the water."],"tag":"turtle3"},{"patterns":["I think my bird might have been a mushroom, what can I do?"],"link":" ","responses":["Mushrooms are among the most common diseases in bird diseases. The way to find out if your little bird has caught mushroom is very simple; You can understand your little bird by looking at the beak and its areas such as sides, feet, and eye edges. If your little bird's skin looks like a sponge or its hair is falling out, your little bird is likely to have a fungus. Skin loses its vitality in the mushroom area of &#8203;&#8203;your little bird. If you do not treat your little bird, deformities may occur in your little bird's body. If your budgerigar got fungal disease, there are many reasons such as using unhygienic food, not caring for cage cleaning, lack of Vitamin A in your bird, excessive hot and humid environment, smoking while in the same room as your bird. If your little bird's immune system is weak, or if your bird is still a baby, there is a high risk of developing fungal disease. If your little bird gets fungal disease, a veterinarian must first see it. You can clean the diseased parts of the dead area with oxygenated water and a swab. Then you can heal your little bird by using the medicine your veterinarian will give for treatment."],"tag":"bird"},{"patterns":["my iguana has fungus, what can I do"],"link":" \/menuContent-67","responses":["In addition to washing the area with antiseptic and using an antifungal ointment that acts on the fungus, it is useful to carry out cage disinfection."],"tag":"iguana"},{"patterns":["my iguana has black mustard yellow color, what could be the problem"],"link":"  ","responses":["The black mustard color indicates that it is malnourished. You have to change his diet. If there is no improvement, please consult your vet."],"tag":"iguana2"},{"patterns":["example question"],"link":" \/menuContent-30","responses":["answer"],"tag":"example"},{"patterns":["   "],"link":"\/homepage-Vets","responses":["I don't know, you can ask our vets."],"tag":"dontknow"}]}